Dynamo.Engine.ShortestQualifiedNameReplacer
Replaces a fully qualified class name with a short name.
Ensures that fully qualified namespaces of classes with the same name are
automatically shortened to partial namespaces so that they can still be resolved uniquely.
E.g., given {"A.B.C.D.E", "X.Y.A.B.E.C.E", "X.Y.A.C.B.E"}, all with the same class E,
their shortest unique names would be: {"D.E", "E.E", "C.B.E"}.
Also replaces DesignScript.BuiltIn.Get.ValueAtIndex(exp1, exp2) calls to exp1[exp2] expressions.

Dynamo.Engine.ShortestQualifiedNameReplacer.TryBuildIndexingExpression(ProtoCore.AST.AssociativeAST.IdentifierListNode,ProtoCore.AST.AssociativeAST.ArrayNameNode@)
If node is a DesignScript.BuiltIn.Get.ValueAtIndex(exp1, exp2) function call node.
it is transformed into a node with indexing operator e.g. exp1[exp2].
node: input node
indexExp: output node
Returns: true if input expression is of the form DesignScript.BuiltIn.Get.ValueAtIndex(exp1, exp2), false otherwise