Dynamo.Configuration.PreferenceSettings.DefaultBackupInterval
The default time interval between backup files. 1 minute.

Dynamo.Configuration.PreferenceSettings.IsTimeStampIncludedInExportFilePath
This defines if the user export file path would include timestamp

Dynamo.Configuration.PreferenceSettings.IsADPAnalyticsReportingApproved
Indicates whether ADP analytics reporting is approved or not.
Note that the getter will communicate to a analytics server which might be slow.
This API should only be used in UI scenarios (not in performance sensitive areas)

Dynamo.Configuration.PreferenceSettings.Locale
The locale of Dynamo UI, serialize locale instead of language name as ease of conversion back and forth

Dynamo.Configuration.PreferenceSettings.GraphicScaleUnit
Contains the currently selected unit used for scaling the graphic helpers (grids, axes)

Dynamo.Configuration.PreferenceSettings.UseHostScaleUnits
Indicates if Host units should be used for graphic helpers for Dynamo Revit

Dynamo.Configuration.PreferenceSettings.LibraryZoomScale
Indicates the zoom scale of the library

Dynamo.Configuration.PreferenceSettings.PythonScriptZoomScale
Indicates the zoom scale of the Python editor

Dynamo.Configuration.PreferenceSettings.GridScaleFactor
Sets the background grid element scale

Dynamo.Configuration.PreferenceSettings.CurrentHostUnits
The current Host document units. Will be updated the first time Dynamo is started

Dynamo.Configuration.PreferenceSettings.DefaultScaleFactor
Default geometry scale factor for a new workspace

Dynamo.Configuration.PreferenceSettings.ShowEdges
Indicates whether surface and solid edges will
be rendered.

Dynamo.Configuration.PreferenceSettings.BackupLocation
Backup files path

Dynamo.Configuration.PreferenceSettings.DisableTrustWarnings
If true, trust warnings for opening .dyn files from untrusted locations will not be shown.
Do not use this property setter, it does nothing. Exists only to support serialization.

Dynamo.Configuration.PreferenceSettings.trustedLocations
This represents the user modifiable list of locations.

Dynamo.Configuration.PreferenceSettings.DeserializeInternalPrefs(System.String)
Manually deserialize some preferences from the PreferencesSettings file.
This is done so that we can avoid exposing these property setters to the public API.
prefsFilePath:

Dynamo.Configuration.PreferenceSettings.DeserializeInternalPrefsContent(System.String)
Manually deserialize some preferences from the PreferencesSettings file.
This is done so that we can avoid exposing these property setters to the public API.
content: The content of the XML file

Dynamo.Configuration.PreferenceSettings.TrustedLocations
Represents a copy of the list of trusted locations that the user added.
Do not use this list to check if a new path is trusted or not.
To check if a new path is trusted or not please use the IsTrustedLocation API (IsTrustedLocation supports locations)

Dynamo.Configuration.PreferenceSettings.HideNodesBelowSpecificConfidenceLevel
This defines if user wants to hide the nodes below a specific confidenc level.

Dynamo.Configuration.PreferenceSettings.MLRecommendationConfidenceLevel
This defines the level of confidence related to the ML recommendation.

Dynamo.Configuration.PreferenceSettings.MLRecommendationNumberOfResults
This defines the number of results of the  ML recommendation

Dynamo.Configuration.PreferenceSettings.HideAutocompleteMethodOptions
If true, autocomplete method options are hidden from UI

Dynamo.Configuration.PreferenceSettings.EnableNotificationCenter
This defines if user wants to see the enabled Dynamo Notification Center.

Dynamo.Configuration.PreferenceSettings.EnablePersistExtensions
This defines if user wants the Extensions settings to persist across sessions.

Dynamo.Configuration.PreferenceSettings.EnableStaticSplashScreen
This defines if the user wants to see the static splash screen again

Dynamo.Configuration.PreferenceSettings.DefaultNodeAutocompleteSuggestion
Defines the default method of the Node Autocomplete

Dynamo.Configuration.PreferenceSettings.GroupStyleItemsList
Stores the group styles added in the preference settings

Dynamo.Configuration.PreferenceSettings.nodeSearchTagSizeLimit
Limits the size of the tags used by the SearchDictionary
This static property is not serialized and is assigned NodeSearchTagSizeLimit's value
if found at deserialize time.

Dynamo.Configuration.PreferenceSettings.ironPythonResolveTargetVersion
The Version of the IronPython package that Dynamo will download when it is found as missing in graphs.
This static property is not serialized and is assigned IronPythonResolveTargetVersion's value
if found at deserialize time.

Dynamo.Configuration.PreferenceSettings.ReadNotificationIds
Stores the notification ids that was read by the user

Dynamo.Configuration.PreferenceSettings.DynamoPlayerFolderGroups
Collections of folders used by individual Dynamo Player or Generative Design as entry points.

Dynamo.Configuration.PreferenceSettings.Load(System.String)
Loads PreferenceSettings from specified XML file if possible,
else initializes PreferenceSettings with default values.
filePath: Path of the XML File
Returns:
Stored PreferenceSettings from xml file or
Default PreferenceSettings if xml file is not found.

Dynamo.Configuration.PreferenceSettings.LoadContent(System.String)
Loads PreferenceSettings from specified XML file if possible,
else initializes PreferenceSettings with default values.
content: The content of the xml file
Returns:

Dynamo.Configuration.PreferenceSettings.PredefinedGroupStyleFontSizes
Return the predefined Font size values

Dynamo.Configuration.PreferenceSettings.SanitizeValues
Checking for invalid values or tainted data and sanitize them

Dynamo.Configuration.PreferenceSettings.AddTrustedLocation(System.String)
Add a path to the Dynamo's trusted locations
path: The path to be added as a trusted location
Returns: True if the path was successfully added. False otherwise.

Dynamo.Configuration.PreferenceSettings.RemoveTrustedLocation(System.String)
Remove a path from the Dynamo's trusted locations
path: The path to be removed from the trusted locations
Returns: The true if the path was removed and false otherwise

Dynamo.Configuration.PreferenceSettings.SetTrustedLocations(System.Collections.Generic.IEnumerable{System.String})
Set trusted locations in the PreferenceSettings configuration.
locs:

Dynamo.Configuration.PreferenceSettings.SetTrustedLocationsUnsafe(System.Collections.Generic.IEnumerable{System.String})
Set trusted locations in the PreferenceSettings configuration without checking if inputs are valid.
Use this method only in tests.
locs:

Dynamo.Configuration.PreferenceSettings.SetTrustWarningsDisabled(System.Boolean)
Disable Trust Warnings for file security
disabled:

Dynamo.Configuration.PreferenceSettings.isTrustedLocationInternal(System.String)
Returns true if the input "location" is among the stored trusted paths.
Subdirectories of a trusted path are considered trusted.
Does not validate the input for correctness.
location:
Returns:

Dynamo.Configuration.PreferenceSettings.IsTrustedLocation(System.String)
Checkes whether the input argument (path) is among Dynamo's trusted locations
Only directories are supported.
Subdirectories of a trusted directory are considered trusted.
location: An absolute path to a folder or file on disk
Returns: True if the path is a trusted location, false otherwise

Dynamo.Configuration.PreferenceSettings.AskForTrustedLocation(System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
AskForTrustedLocation function
isOpenedFile:
isHomeSpace:
isShowStartPage:
isDisableTrustWarnings:
isFileInTrustedLocation:
Returns:

Dynamo.Configuration.PreferenceSettings.MessageLogged
Log message event

Dynamo.Configuration.PreferenceSettings.StaticFields
List of static Fields to be excluded for evaluation due to their access level
Returns:

Dynamo.Configuration.PreferenceSettings.IsCreatedFromValidFile
Indicates when an instance has been created from a preferences file correctly, a support property