Dynamo.Core.PathManager.HasPathResolver
This function indicates if there is an already assigned Path Resolver , otherwise it will take from the ctor config

Dynamo.Core.PathManager.AssignHostPathAndIPathResolver(System.String,Dynamo.Interfaces.IPathResolver)
Assigns a hostPath and IPathResolver on demand with the same behavior as the Ctor.
hostPath:
///
resolver:

Dynamo.Core.PathManager.BuildHostDirectories(System.String)
Build the Extensions and ViewExtensions directories based on the Host.
hostPath:

Dynamo.Core.PathManager.BuildUserSpecificDirectories
Build directories based on the User.

Dynamo.Core.PathManager.BuildCommonDirectories
Build common Directories.

Dynamo.Core.PathManager.LoadPathsFromResolver
Load the Paths based on the Resolver
Throws System.IO.DirectoryNotFoundException: