Dynamo.Configuration.ExtensionMethods.CopyProperties(Dynamo.Configuration.PreferenceSettings,Dynamo.Configuration.PreferenceSettings)
Copy Properties from a PreferenceSettings instance to another iterating the Properties of the destination instance and populate them from their source counterparts, excluding the properties that are obsolete and only read.
source:
destination: