Dynamo.Graph.Notes.NoteModel.UndoRequest
This action is triggered when undo command is pressed and a node is pinned

Dynamo.Graph.Notes.NoteModel.TryToSubscribeUndoNote
Verify if the current user action is to pin a node so the 'unpin' method can be called to undo the action