Dynamo.Configuration.StyleItem
This class stores the group styles added by the user

Dynamo.Configuration.StyleItem.Name
This property will contain the Group Name of the stored style

Dynamo.Configuration.StyleItem.HexColorString
This property will contain the color in hexadecimal

Dynamo.Configuration.StyleItem.IsDefault
This property will describe if the current GroupStyle added is a default one or a custom one.

Dynamo.Configuration.StyleItem.FontSize
This property will support the font size of the GroupStyle

Dynamo.Configuration.StyleItem.GroupStyleId
This property will support the id of the Groupstyle