Dynamo.Logging.DynamoLogger.#ctor(Dynamo.Configuration.DebugSettings,System.String,System.Boolean,System.Boolean)
Initializes a new instance of Dynamo.Logging.DynamoLogger class
with specified debug settings and directory where to write logs
debugSettings: Debug settings
logDirectory: Directory path where log file will be written
isTestMode: Test mode is true or false.
isCLIMode: We want to allow logging when CLI mode is true even if we are in test mode.

Dynamo.Logging.DynamoLogger.#ctor(Dynamo.Configuration.DebugSettings,System.String,System.Boolean,System.Boolean,System.Boolean)
Initializes a new instance of Dynamo.Logging.DynamoLogger class
with specified debug settings and directory where to write logs
debugSettings: Debug settings
logDirectory: Directory path where log file will be written
isTestMode: Test mode is true or false.
isCLIMode: We want to allow logging when CLI mode is true even if we are in test mode.
isServiceMode: We want restrict logging in service mode to console only due to lambda limitations.
TODO(DYN-5757): Review usage of isTestMode,isTestMode,isServiceMode across Dynamo and see how we can consildate all these flags.