Dynamo.Graph.Workspaces.HomeWorkspaceModel.GraphRunInProgress
A flag which indicates whether Dynamo is currently running a graph.
This flag is set to true when execution starts and is set to false
when execution is completed.

Dynamo.Graph.Workspaces.HomeWorkspaceModel.EvaluationStarted
Notifies listeners that graph evaluation is started.
At this stage, the graph has not been analyzed yet
so Dynamo could find that the Graph does not need to be executed at all,
or only part of it could be executed (delta compute)