Dynamo.Configuration.DynamoPlayerFolder
This class describes a folder (usually containing Dynamo graphs) added to the Dynamo Player or Generative Design

Dynamo.Configuration.DynamoPlayerFolder.Path
The full path of the folder

Dynamo.Configuration.DynamoPlayerFolder.DisplayName
The display name of the folder

Dynamo.Configuration.DynamoPlayerFolder.Id
The ID of the folder

Dynamo.Configuration.DynamoPlayerFolder.IsRemovable
Is this folder removable from the settings (Built-in folders are non-removable)

Dynamo.Configuration.DynamoPlayerFolder.Order
The order of the folder

Dynamo.Configuration.DynamoPlayerFolder.IsValid
Is the folder path a valid path

Dynamo.Configuration.DynamoPlayerFolder.IsDefault
Is the folder path the default directory of the list