Dynamo.Interfaces.IHideAutocompleteMethodOptions
Temporary interface to avoid breaking changes.
TODO: Merge with StartupConfiguration for 3.0 (DYN-1699)

Dynamo.Interfaces.IHideAutocompleteMethodOptions.HideAutocompleteMethodOptions
If true, autocomplete method options are hidden from UI