Dynamo.Wpf.Interfaces.LayoutSpecification.MergeLayoutSpecs(Dynamo.Wpf.Interfaces.LayoutSpecification,Dynamo.Wpf.Interfaces.LayoutSpecification)
Merge two layout specs.
mainSpec: Original spec, will be cloned before modifications are made.
specToMerge: This spec will be merged into mainspec.
Returns: A modified spec with specToMerge merged into mainSpec. mainSpec object will not be modified.

Dynamo.Wpf.Interfaces.LayoutSpecification.MergeLayoutElements(Dynamo.Wpf.Interfaces.LayoutElement,Dynamo.Wpf.Interfaces.LayoutElement,Dynamo.Wpf.Interfaces.LayoutElementType)
Recursive function to merge one layout element into another based on element.text and type for matching.
Will not merge any information between elements (include info, path etc) will only move child elements.
orgElement:
mergeElement:
type:
Throws System.ArgumentException: