Dynamo.Configuration.DynamoPlayerFolderGroup
This class defines a group of folders associated with a Dynamo Player or Generative Design entry point.

Dynamo.Configuration.DynamoPlayerFolderGroup.EntryPoint
The name of the Player entry point

Dynamo.Configuration.DynamoPlayerFolderGroup.Folders
The List of Folder Items for this group