Dynamo.Core.CrashErrorReportArgs
Event argument for CER (crash error reporting) tool.
It contains options on what to send out with the crash report.

Dynamo.Core.CrashErrorReportArgs.#ctor(System.Exception)
Constructs the options class to customize what CER will collect.
e:

Dynamo.Core.CrashErrorReportArgs.#ctor(System.String)
Constructs the options class to customize what CER will collect.
details: Crash details

Dynamo.Core.CrashErrorReportArgs.SendLogFile
Allow Dynamo to send the log file to the CER system.

Dynamo.Core.CrashErrorReportArgs.SendSettingsFile
Allow Dynamo to send the settings file to the CER system.

Dynamo.Core.CrashErrorReportArgs.SendRecordedCommands
Allow Dynamo to send the recorded commands file to the CER system.