Dynamo.Properties.Resources.AutocompleteLowConfidenceMessage
Looks up a localized string similar to All recommendations are below the specified confidence level. You can try them or adjust the confidence settings in Preferences..

Dynamo.Properties.Resources.AutocompleteLowConfidenceTitle
Looks up a localized string similar to Low confidence.

Dynamo.Properties.Resources.AutocompleteLowConfidenceTooltip
Looks up a localized string similar to Show Recommendations that are below the confidence level..

Dynamo.Properties.Resources.AutocompleteNoRecommendationsMessage
Looks up a localized string similar to There are no recommendations yet. You can try switching to node type match autocomplete..

Dynamo.Properties.Resources.AutocompleteNoRecommendationsTitle
Looks up a localized string similar to No recommendations.

Dynamo.Properties.Resources.DynamoLanguages_noxlate
Looks up a localized string similar to English,Čeština,Deutsch,Español,Français,Italiano,日本語,한국어,Polski,Português (Brasil),Русский,简体中文,繁體中文.

Dynamo.Properties.Resources.FailedInsertFileNodeExistNotification
Looks up a localized string similar to Failed to insert the file as some of the nodes already exist in the current worspace..

Dynamo.Properties.Resources.FileLoadFailureMessageBoxTitle
Looks up a localized string similar to File load failure.

Dynamo.Properties.Resources.GroupDefaultText
Looks up a localized string similar to Description <Double click here to edit group description>.

Dynamo.Properties.Resources.GroupNameDefaultText
Looks up a localized string similar to Title <Double click here to edit group title>.

Dynamo.Properties.Resources.GroupStyleDefaultActions
Looks up a localized string similar to Actions.

Dynamo.Properties.Resources.GroupStyleDefaultActionsColor
Looks up a localized string similar to B9F9E1.

Dynamo.Properties.Resources.GroupStyleDefaultInputs
Looks up a localized string similar to Inputs.

Dynamo.Properties.Resources.GroupStyleDefaultInputsColor
Looks up a localized string similar to FFB8D8.

Dynamo.Properties.Resources.GroupStyleDefaultOutputs
Looks up a localized string similar to Outputs.

Dynamo.Properties.Resources.GroupStyleDefaultOutputsColor
Looks up a localized string similar to FFC999.

Dynamo.Properties.Resources.GroupStyleDefaultReview
Looks up a localized string similar to Review.

Dynamo.Properties.Resources.GroupStyleDefaultReviewColor
Looks up a localized string similar to A4E1FF.

Dynamo.Properties.Resources.InsertDialogBoxText
Looks up a localized string similar to Insert Dynamo Definition....

Dynamo.Properties.Resources.InsertGraphRunModeNotificationText
Looks up a localized string similar to Example file added to workspace. Run mode changed to Manual..

Dynamo.Properties.Resources.LoginNeededMessage
Looks up a localized string similar to You need to login to your account to get recommendations. Please log in or switch to node type match autocomplete..

Dynamo.Properties.Resources.LoginNeededTitle
Looks up a localized string similar to Not authenticated.

Dynamo.Properties.Resources.SplashScreenInitPreferencesSettings
Looks up a localized string similar to Initializing preferences....

Dynamo.Properties.Resources.SplashScreenLoadNodeLibrary
Looks up a localized string similar to Loading Node Library....

Dynamo.Properties.Resources.ToolTipInputData
Looks up a localized string similar to Input Data.

Dynamo.Properties.Resources.ToolTipOutputData
Looks up a localized string similar to Output Data.

Dynamo.Properties.Resources.UnresolvedNodesWarningMessage
Looks up a localized string similar to This may be caused by a missing package, incompatible package version, or missing host program. If you Save As, the unresolved nodes will be removed.
Resolve or remove the unresolved nodes and try again..

Dynamo.Properties.Resources.UnresolvedNodesWarningShortMessage
Looks up a localized string similar to The graph has unresolved nodes and cannot be saved..

Dynamo.Properties.Resources.UnresolvedNodesWarningTitle
Looks up a localized string similar to Unable to save graph.