Dynamo.Core.IDSDKManager
The class to provide auth APIs for IDSDK related methods.

Dynamo.Core.IDSDKManager.RequestLogin
Used by the auth provider to request authentication.

Dynamo.Core.IDSDKManager.LoginStateChanged
Tracks any change in the login status.

Dynamo.Core.IDSDKManager.LoginState
Returns the login status of the current session.
Returns: LoginState Enum value

Dynamo.Core.IDSDKManager.IsLoggedIn
Returns the login status of the current session.
Returns: Boolean Status Value

Dynamo.Core.IDSDKManager.Login
Triggers login using Auth API, if the user is not already logged in.
Returns: True, if login was successfull, else False

Dynamo.Core.IDSDKManager.Logout
Logs out the user from the current session.

Dynamo.Core.IDSDKManager.Username
Gets the username of the logged in user.

Dynamo.Core.IDSDKManager.SignRequest(RestSharp.RestRequest@,RestSharp.RestClient)
Used by the auth provider to sign request with the authorized token.

Dynamo.Core.IDSDKManager.LoginRequest(RestSharp.RestRequest@,RestSharp.RestClient)
Checks if the user is logged in and adds the token to request header.

Dynamo.Core.IDSDKManager.IDSDK_GetToken
Returns the OAuth2 token for the current session, or an empty string if token is not available.