Dynamo.Models.DynamoModel.OpenFileFromJsonCommand
A command to open a file from Json content.

Dynamo.Models.DynamoModel.OpenFileFromJsonCommand.#ctor(System.String,System.Boolean)
fileContents: The Json content of a file.
forceManualExecutionMode: Should the file be opened in manual execution mode?