Dynamo.Models.DynamoModel.IsASMLoaded
Indicating if ASM is loaded correctly, defaulting to true because integrators most likely have code for ASM preloading
During sandbox initializing, Dynamo checks specifically if ASM loading was correct

Dynamo.Models.DynamoModel.IsHeadless
Flag to indicate that there is no UI on this process, and things
like the node index process, update manager and the analytics collection
should be disabled.

Dynamo.Models.DynamoModel.IsServiceMode
Boolean indication of launching Dynamo in service mode, this mode is optimized for minimal launch time, mostly leveraged by CLI or WPF CLI.

Dynamo.Models.DynamoModel.CLIMode
CLIMode indicates if we are running in DynamoCLI or DynamoWPFCLI mode.
Note that in CLI mode Scheduler is synchronous.

Dynamo.Models.DynamoModel.CERLocation
The Autodesk CrashReport tool location on disk (directory that contains the "senddmp.exe")

Dynamo.Models.DynamoModel.CreatePathManager(Dynamo.Models.DynamoModel.IStartConfiguration)
It returns a PathManager instance based on the mode in order to reuse it's Singleton instance or create a new one
config:
Returns:

Dynamo.Models.DynamoModel.CreateOrLoadPreferences(Dynamo.Interfaces.IPreferences)
Create or load a preference checking the usage mode and if it already exists
preferences:
Returns:

Dynamo.Models.DynamoModel.LogInfoMessage(DynamoServices.LogWarningMessageEventArgs)
This info message is displayed on the node associated with the FFI dll
args:

Dynamo.Models.DynamoModel.OpenFileFromJson(System.String,System.Boolean)
Opens a Dynamo workspace from a Json string.
fileContents: Json file content
forceManualExecutionMode: Set this to true to discard
execution mode specified in the file and set manual mode

Dynamo.Models.DynamoModel.InsertFileFromPath(System.String,System.Boolean)
Inserts a Dynamo graph or Custom Node inside the current workspace from a file path
filePath:
forceManualExecutionMode:

Dynamo.Models.DynamoModel.OpenXmlFileFromPath(System.Xml.XmlDocument,System.String,System.Boolean)
Opens a Dynamo workspace from a path to an Xml file on disk.
xmlDoc: xml file content
filePath: Path to file
forceManualExecutionMode: Set this to true to discard
execution mode specified in the file and set manual mode
Returns: True if workspace was opened successfully

Dynamo.Models.DynamoModel.ExtraWorkspaceViewInfoFromJson(System.String)
Load the extra view information required to fully construct a WorkspaceModel object
json:

Dynamo.Models.DynamoModel.AddGroupsToGroup(System.Collections.Generic.List{Dynamo.Graph.ModelBase},System.Guid)
Add a list of annotations to the host group on model level.
modelsToAdd: List of annotation models.
hostGroupGuid: Host annotation guid.

Dynamo.Models.DynamoModel.AddNodeTypeToSearchIndex(Dynamo.Search.SearchElements.NodeSearchElement,Lucene.Net.Documents.Document)
Add node information to Lucene index
node: node info that will be indexed
doc: Lucene document in which the node info will be indexed

Dynamo.Models.DynamoModel.RemoveNodeTypeFromSearchIndex(Dynamo.Search.SearchElements.NodeSearchElement)
Remove node information from Lucene indexing.
node: node info that needs to be removed.

Dynamo.Models.DynamoModel.RequestUpdateLoadBarStatus
Event to throw for Splash Screen to update Dynamo launching tasks

Dynamo.Models.DynamoModel.LanguageDetected
Event to throw for Splash Screen to display the content in the proper language

Dynamo.Models.DynamoModel.OnRequestsCrashPrompt(System.Object,Dynamo.Core.CrashPromptArgs)
Shows the crash error reporting window.
This method will always try to show the Autodesk CER UI first (if the CER tool is found on disk).
If the CER tool is not found, the Dynamo in-house crash prompt will be shown.
sender:
args: Can be called with CrashErrorReportArgs or CrashPromptArgs

Dynamo.Models.DynamoModel.OnRequestsCrashPrompt(Dynamo.Core.CrashErrorReportArgs)
Shows the crash error reporting window.
This method will always try to show the Autodesk CER UI first (if the CER tool is found on disk).
If the CER tool is not found, the Dynamo in-house crash prompt will be shown.
args: CER options

Dynamo.Models.DynamoModel.RequestNotification
This event is used to raise a toast notification from the DynamoViewModel