Dynamo.Configuration.LuceneConfig
This class includes all settings of Lucene search

Dynamo.Configuration.LuceneConfig.LuceneNetVersion
Specify the Lucene.Net compatibility version

Dynamo.Configuration.LuceneConfig.DefaultOperator
Default operator for Lucence query parser

Dynamo.Configuration.LuceneConfig.MinimumSimilarity
MinimumSimilarity value

Dynamo.Configuration.LuceneConfig.FuzzySearchMinimalTermLength
Minimal length of the search term that the fuzzy search to take effect

Dynamo.Configuration.LuceneConfig.FuzzySearchMinEdits
Minimal edits for typo check in FuzzyQuery

Dynamo.Configuration.LuceneConfig.FuzzySearchMaxEditsThreshold
Minimal length of the search term that the fuzzy search max edits limit to take effect

Dynamo.Configuration.LuceneConfig.FuzzySearchMaxEdits
Maximal edits for typo check in FuzzyQuery, value larger than 3 is not proper according to
https://blog.mikemccandless.com/2011/03/lucenes-fuzzyquery-is-100-times-faster.html

Dynamo.Configuration.LuceneConfig.DefaultResultsCount
Default max results count in Dynamo to display

Dynamo.Configuration.LuceneConfig.SearchNameWeight
Search name matching weight

Dynamo.Configuration.LuceneConfig.SearchCategoryWeight
Search Category matching weight

Dynamo.Configuration.LuceneConfig.SearchDescriptionWeight
Search Description matching weight

Dynamo.Configuration.LuceneConfig.SearchTagsWeight
Search tags matching weight

Dynamo.Configuration.LuceneConfig.SearchMetaFieldsWeight
other fields search matching weight

Dynamo.Configuration.LuceneConfig.WildcardsSearchNameWeight
Wildcards search name matching weight

Dynamo.Configuration.LuceneConfig.WildcardsSearchCategoryWeight
Wildcards search Category matching weight

Dynamo.Configuration.LuceneConfig.WildcardsSearchDescriptionWeight
Wildcards search Description matching weight

Dynamo.Configuration.LuceneConfig.WildcardsSearchTagsWeight
Wildcards search tags matching weight

Dynamo.Configuration.LuceneConfig.WildcardsSearchMetaFieldsWeight
other wildcards fields search matching weight

Dynamo.Configuration.LuceneConfig.WildcardsSearchNameParsedWeight
Wildcards search name matching weight

Dynamo.Configuration.LuceneConfig.FuzzySearchWeight
Fuzzy search matching weight

Dynamo.Configuration.LuceneConfig.Index
Parent directory where information is indexed.

Dynamo.Configuration.LuceneConfig.NodesIndexingDirectory
Directory where Nodes info are indexed

Dynamo.Configuration.LuceneConfig.PackagesIndexingDirectory
Directory where packages info are indexed

Dynamo.Configuration.LuceneConfig.NodeIndexFields
Nodes Fields to be indexed by Lucene Search

Dynamo.Configuration.LuceneConfig.PackageIndexFields
Package Fields to be indexed by Lucene Search