Dynamo.Search.LuceneSearch
Singleton class that has access to all the lucene search utility classes.

Dynamo.Search.LuceneSearch.lazy
Use Lazy<LuceneSearch> to make sure the Singleton class is only initialized once

Dynamo.Search.LuceneSearch.Instance
The actual instance stored in the Singleton class

Dynamo.Search.LuceneSearch.LuceneUtilityNodeSearch
LuceneSearchUtility for library node search or in-canvas search

Dynamo.Search.LuceneSearch.LuceneUtilityNodeAutocomplete
LuceneSearchUtility for nodeaautocomplete.

Dynamo.Search.LuceneSearch.LuceneUtilityPackageManager
LuceneSearchUtility for packages in package manager.