Dynamo.Utilities.LuceneSearchUtility.InitializeLuceneConfig(System.String,Dynamo.Utilities.LuceneSearchUtility.LuceneStorage)
Initialize Lucene config file writer.

Dynamo.Utilities.LuceneSearchUtility.InitializeIndexDocumentForNodes
Initialize Lucene index document object for reuse
Returns:

Dynamo.Utilities.LuceneSearchUtility.InitializeIndexDocumentForPackages
Initialize Lucene index document object for reuse
Returns:

Dynamo.Utilities.LuceneSearchUtility.SetDocumentFieldValue(Lucene.Net.Documents.Document,System.String,System.String,System.Boolean,System.Boolean)
The SetDocumentFieldValue method should be optimized later
doc: Lucene document in which the information is stored
field: Field that is being updated in the document
value: Field value
isTextField: This is used when the value need to be tokenized(broken down into pieces), whereas StringTextFields are tokenized.
isLast: This is used for the last value set in the document. It will fetch all the fields not set in the document and add them with an empty string.

Dynamo.Utilities.LuceneSearchUtility.CreateSearchQuery(System.String[],System.String)
Creates a search query with adjusted priority, fuzzy logic and wildcards.
Complete Search term appearing in Name of the package will be given highest priority.
Then, complete search term appearing in other metadata,
Then, a part of the search term(if containing multiple words) appearing in Name of the package
Then, a part of the search term appearing in other metadata of the package.
Then priority will be given based on fuzzy logic- that is if the complete search term may have been misspelled for upto 2(max edits) characters.
Then, the same fuzzy logic will be applied to each part of the search term.
fields: All fields to be searched in.
SearchTerm: Search key to be searched for.
Returns:

Dynamo.Utilities.LuceneSearchUtility.CreateAnalyzerByLanguage(System.String)
It creates an Analyzer to be used in the Indexing based on the user preference language
Returns: