Dynamo.Models.SplashScreenLoadEventArgs
Event arguments when creating a splash screen event

Dynamo.Models.SplashScreenLoadEventArgs.#ctor(System.String,System.Single)
Constructor
loadDescription: Load message
barSize: Load bar size