Dynamo.Search.SearchElements.AutoCompletionNodeMachineLearningInfo
This class will support the Machine Learning info related to a node element of Auto-completion feature.

Dynamo.Search.SearchElements.AutoCompletionNodeMachineLearningInfo.#ctor
default constructor

Dynamo.Search.SearchElements.AutoCompletionNodeMachineLearningInfo.#ctor(System.Boolean,System.Boolean,System.Double)
Creates ML info object using DisplayIcon, IsByRecommendation and ConfidenceScore params
displayIcon: True if the user can view the confidence score or the recent use icon, otherwise False
isByRecommendation: True if the Node is part of the ML recommendation, otherwise False
confidenceScore: Confidence Score

Dynamo.Search.SearchElements.AutoCompletionNodeMachineLearningInfo.DisplayIcon
Indicates if the icon is displayed to show the condifent score or by-usage

Dynamo.Search.SearchElements.AutoCompletionNodeMachineLearningInfo.ConfidenceScore
Confidence score in percentage

Dynamo.Search.SearchElements.AutoCompletionNodeMachineLearningInfo.IsByUse
Indicates if the Node is part of ML result per use

Dynamo.Search.SearchElements.AutoCompletionNodeMachineLearningInfo.IsByRecommendation
Indicates if the Node is part of the ML result per recommendation