Dynamo.Models.DynamoModel.CrashReporterStartupOptions
Options used to customize the CER (crash error reporting) experience.

Dynamo.Models.DynamoModel.CrashReporterStartupOptions.CERLocation
The Autodesk CrashReport tool location on disk (directory that contains the "senddmp.exe")