Dynamo.Graph.Nodes.CodeBlockNodeModel.#ctor
This is the default constructor only used for search indexing purposes (if doesn't exist then the DynamoModel.AddNodeTypeToSearch() method is crashing due that is expecting a default constructor)