Dynamo.Core.PropertyChangeManager
Class can be used to stop property change notifications from being raised if the client object
inherits from Dynamo.Core.NotificationObject and uses RaisePropertyChanged to raise prop notifications.
Use like:
using (node.SetPropsToSupress("frozen")){
node.frozen = true;
}

Dynamo.Core.PropertyChangeManager.SetPropsToSuppress(System.String[])
Disable property change notifications for a list of a props.
The previous set of suppressed notifications will be cleared.
This API is meant to be used only for a short time and Dispose should be
called on the object this call returns.
props:
Returns:

Dynamo.Core.PropertyChangeManager.Dispose
Disposing this class will allow prop notifications to be raised.

Dynamo.Core.PropertyChangeManager.ShouldRaiseNotification(System.String)
Checks if notifications are suppressed for a specific property.
prop:
Returns: