Dynamo.Configuration.ViewExtensionSettings.IsOpen
Specifies if the extension was Open in the last session before closing Dynamo, if the property to remember view extension status was enabled. Default: False