Dynamo.Configuration.Configurations.ZoomThreshold
Global zoom threshold level for node overlay to apply (zoom-in/out behavior)

Dynamo.Configuration.Configurations.ZoomDirectEditThreshold
Global zoom threshold for renaming Nodes and Notes

Dynamo.Configuration.Configurations.SupportedLocaleList
Supported locales as a list

Dynamo.Configuration.Configurations.SupportedLocaleDic
Supported languages and locales as a dictionary in the current thread locale

Dynamo.Configuration.Configurations.SupportedUnits
Supported Host units and their conversion to dynamo units
Used in graphic helpers scaling (grid, axes)