Dynamo.Configuration.LuceneConfig.NodeFieldsEnum
This represent the fields that will be indexed when initializing Lucene Search

Dynamo.Configuration.LuceneConfig.NodeFieldsEnum.Name
Name - The name of the node

Dynamo.Configuration.LuceneConfig.NodeFieldsEnum.FullCategoryName
FullCategoryName - The category of the node

Dynamo.Configuration.LuceneConfig.NodeFieldsEnum.Description
Description - The description of the node

Dynamo.Configuration.LuceneConfig.NodeFieldsEnum.SearchKeywords
SearchKeywords - Several keywords that will be used when searching any word (this values are coming from xml files like BuiltIn.xml, DesignScriptBuiltin.xml or ProtoGeometry.xml)

Dynamo.Configuration.LuceneConfig.NodeFieldsEnum.DocName
DocName - Name of the Document

Dynamo.Configuration.LuceneConfig.NodeFieldsEnum.Documentation
Documentation - Documentation of the node

Dynamo.Configuration.LuceneConfig.NodeFieldsEnum.Hosts
Hosts - Package hosts

Dynamo.Configuration.LuceneConfig.NodeFieldsEnum.Parameters
Node Input Parameters as string (there are nodes with same name and category but different parameters)