Dynamo.Utilities.LuceneCustomAnalyzer
Due that the Lucene StandardAnalyzer removes special characters/words like "+", "*", "And" then we had to implement a Custom Analyzer that support that that kind of search terms