Dynamo.Configuration.GroupStyleItem
Group specific style item
Note: This class does not contain special property yet comparing to base class

Dynamo.Configuration.GroupStyleItem.DefaultGroupStyleItems
Static set of default group styles defined by Dynamo Team