Dynamo.Graph.Workspaces.WorkspaceModel.DelayGraphExecution
Whether or not to delay graph execution.
64-bit read operations are already atomic so no need to lock here

Dynamo.Graph.Workspaces.WorkspaceModel.NodeLocalDefinitions
Local Node Definitions that the nodes in this graph depend on

Dynamo.Graph.Workspaces.WorkspaceModel.ExternalFiles
External File references that the nodes in this graph depend on

Dynamo.Graph.Workspaces.WorkspaceModel.ComputeNodeLibraryDependencies
Computes the node library dependencies in the current workspace.
Returns:

Dynamo.Graph.Workspaces.WorkspaceModel.ComputeNodeLocalDefinitions
Computes the node local definitions in the current workspace.
Returns:

Dynamo.Graph.Workspaces.WorkspaceModel.ComputeExternalFileReferences
Computes the external file references if the Workspace Model is a HomeWorkspaceModel and graph is not running.
Returns:

Dynamo.Graph.Workspaces.WorkspaceModel.ForceComputeWorkspaceReferences
This flag will indicate if the workspace references should be computed again.

Dynamo.Graph.Workspaces.WorkspaceModel.AddAnnotation(Dynamo.Graph.Annotations.AnnotationModel)
Create parent group given child group,
so far only leveraged in tests so no analytics tracking added for this
annotationModel:

Dynamo.Graph.Workspaces.WorkspaceModel.AddAnnotation(System.String,System.Guid)
Wrapper function of group creation based on Dynamo selection
text: Group description
id: Group id
Returns:

Dynamo.Graph.Workspaces.WorkspaceModel.AddAnnotation(System.String,System.String,System.Guid)
Wrapper function of group creation based on Dynamo selection
titleText: Group title
text: Group description
id: Group id
Returns:

Dynamo.Graph.Workspaces.WorkspaceModel.CreateAndSubcribeAnnotationModel(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel},System.Collections.Generic.IEnumerable{Dynamo.Graph.Notes.NoteModel},System.Collections.Generic.IEnumerable{Dynamo.Graph.Annotations.AnnotationModel},System.Guid,System.String,System.String)
Create new group containing selected elements
nodes: Selected nodes
notes: Selected notes
groups: Selected groups
id: group id
title: group title
description: group description, defaulting to empty string
Returns:

Dynamo.Graph.Workspaces.WorkspaceModel.CheckIfModelExistsInSomeGroup(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel},System.Collections.Generic.IEnumerable{Dynamo.Graph.Notes.NoteModel},System.Collections.Generic.IEnumerable{Dynamo.Graph.Annotations.AnnotationModel})
Checks if selected models exists in some group.
selectedNodes: The selected nodes.
selectedNotes: The selected notes.
selectedGroups: The selected groups.
Returns: true if any of the models are already in a group

Dynamo.Graph.Workspaces.WorkspaceModel.UpdateWithExtraWorkspaceViewInfo(Dynamo.Graph.Workspaces.ExtraWorkspaceViewInfo,System.Double,System.Double)
Updates a workspace model with extra view information. When loading a workspace from JSON,
the data is split into two parts, model and view. This method sets the view information.
This overload allows to 'move' the incoming when placing them
workspaceViewInfo:
offsetX: Offset in X direction (positive - left, negative - right)
offsetY: Offset in Y direction (positive - down, negative - up)