Dynamo.Graph.Nodes.NodeModel.NodeInfoMessagesClearing
Event triggered whenever the node re-executes to clear its info messages

Dynamo.Graph.Nodes.NodeModel.OnNodeInfoMessagesClearing
Fires on each node that is modified to clear info messages, when the graph executes.

Dynamo.Graph.Nodes.NodeModel.Infos
Collection of warnings, errors and info items applied to the NodeModel.

Dynamo.Graph.Nodes.NodeModel.NodeInfos
A publicly accessible collector of all Info/Warning/Error data

Dynamo.Graph.Nodes.NodeModel.AreAllOutputsConnected
Are all the outputs of this node connected?

Dynamo.Graph.Nodes.NodeModel.AreAllInputsDisconnected
Are all the inputs of this node disconnected?

Dynamo.Graph.Nodes.NodeModel.DismissedAlertsCount
Returns the number of dismissed error/warning/info messages.

Dynamo.Graph.Nodes.NodeModel.ClearErrorsAndWarnings
Clears the errors/warnings that are generated when running the graph.

Dynamo.Graph.Nodes.NodeModel.ClearInfoMessages
Clears the info messages that are generated when running the graph,
the State will be set to ElementState.Active.

Dynamo.Graph.Nodes.NodeModel.Info(System.String)
Set an info on a node.
p: The info text.

Dynamo.Graph.Nodes.NodeModel.Info(System.String,System.Boolean)
Set an info on a node.
p: The info text.
isPersistent: Is the info persistent? If true, the info will not be
cleared when the node is next evaluated. If false, the info will be cleared on the next evaluation.

Dynamo.Graph.Nodes.NodeModel.RequestVisualUpdateAsync(Dynamo.Scheduler.IScheduler,Dynamo.Engine.EngineController,Dynamo.Visualization.IRenderPackageFactory,System.Boolean,System.Boolean)
Call this method to asynchronously regenerate render package for
this node. This method accesses core properties of a NodeModel and
therefore is typically called on the main/UI thread.
scheduler: An IScheduler on which the task will be scheduled.
engine: The EngineController which will be used to get MirrorData for the node.
factory: An IRenderPackageFactory which will be used to generate IRenderPackage objects.
forceUpdate: Normally, render packages are only generated when the node's IsUpdated parameter is true.
By setting forceUpdate to true, the render packages will be updated.
ignoreIsVisible: Normally, render packages are only generated when the node's IsVisible parameter is true.
By setting ignore to true, the render package will be updated.
Returns: Flag which indicates if geometry update has been scheduled