Dynamo.Configuration.PreferenceSettings.AskForTrustedLocationResult
Different ways to ask the user about display the Trusted location

Dynamo.Configuration.PreferenceSettings.AskForTrustedLocationResult.Ask
Ask for the Trusted location

Dynamo.Configuration.PreferenceSettings.AskForTrustedLocationResult.DontAsk
Don't ask about the Trusted location

Dynamo.Configuration.PreferenceSettings.AskForTrustedLocationResult.UnableToAsk
Unable to ask about the Trusted location