Dynamo.Core.AuthenticationManager.LoginStateInitial
This Property will return the initial LoginState assigned in the constructor in order to be used in the Initialization flow. Others features require direct calls to the LoginState due to are on demand.

Dynamo.Core.AuthenticationManager.IsLoggedInInitial
This function will return the value by checking the LoginStateSingle property (which load its value only once time) used only in the initialization flow
Returns: