Dynamo.Models.DynamoModel.InsertFileCommand
A command to open a file.

Dynamo.Models.DynamoModel.InsertFileCommand.#ctor(System.String,System.Boolean)
Insert Graph or Custom Node from a file path into the current Workspace
filePath: The path to the file.
forceManualExecutionMode: Should the file be opened in manual execution mode?