Dynamo.Graph.Nodes.NodeModelExtensions.ImediateUpstreamNodes(Dynamo.Graph.Nodes.NodeModel)
Provide the upstream nodes that are imediately connected.
node:
Returns:

Dynamo.Graph.Nodes.NodeModelExtensions.GetPackageName(Dynamo.Graph.Nodes.NodeModel,Dynamo.Graph.Workspaces.PackageInfo)
Returns the package name of the node
node: target NodeModel
Returns: