Dynamo.Graph.Annotations.AnnotationModel.GroupStyleId
Returns the Groupstyle applied

Dynamo.Graph.Annotations.AnnotationModel.IsVisible
Preview visibility of the nodes in a group

Dynamo.Graph.Annotations.AnnotationModel.AddedToGroup
Fired when this group is added to another group

Dynamo.Graph.Annotations.AnnotationModel.AddToTargetAnnotationModel(Dynamo.Graph.ModelBase,System.Boolean)
This is called when a model is added to or deleted from a group.
model: The model.
checkOverlap:  checkoverlap determines whether the selected model is
completely inside that group