Dynamo.Models.RunSettings.ForceBlockRun
This static property if is true will block running the graph in any Run Mode

Dynamo.Models.RunSettings.RunEnabled
A flag which indicates whether running a graph is possible. If set to true,
Dynamo will allow graphs to be run (except if the corresponding dyn file is not trusted)
If set to false, Dynamo will not allow graphs to be run.
The Dynamo UI will reflect the RunEnabled values by enabling/disabling certain UI features (ex. if RunEnabled is false, the Run button will be disabled).

Dynamo.Models.RunSettings.RunTypesEnabled
This property will enable or disable the ComboBox RunTypes