Dynamo.Graph.Nodes.NodeInputTypes
Possible graph input types.

Dynamo.Graph.Nodes.NodeInputTypes.hostSelection
Should not be used when setting NodeInputData.Type, use selection instead, can be used with Type2.

Dynamo.Graph.Nodes.NodeInputTypes.dropdownSelection
Should not be used when setting NodeInputData.Type, use selection instead, can be used with Type2.