Dynamo.Extensions.StartupParams.IsGeometryLibraryLoaded
Returns true if ASM/LibG are loaded. May only be valid in sandbox sessions.

Dynamo.Extensions.StartupParams.#ctor(Dynamo.Models.DynamoModel)
Initializes a new instance of the Dynamo.Extensions.StartupParams class.